;变种人黑暗事件
[DarkEventAbility_AdventAdvancedConditioning X2AbilityTemplate]
LocFriendlyName="黑暗事件：高级调理"
LocFlyoverText="黑暗事件：高级调理"
LocLongDescription="所有变种人士兵获得 <Ability:ADVENT_ADVANCED_CONDITIONING_HP/>% 生命值和 <Ability:ADVENT_ADVANCED_CONDITIONING_MOBILITY/>% 移动力。"
LocHelpText="额外的机动性和生命值。"
LocPromotionPopupText="变种人单位的生命值增加了 <Ability:ADVENT_ADVANCED_CONDITIONING_HP/>%，移动性增加了 <Ability:ADVENT_ADVANCED_CONDITIONING_MOBILITY/>%。"

[DarkEvent_AdventAdvancedConditioning X2DarkEventTemplate]
+DisplayName="外星高级调理"
+SummaryText="所有变种人士兵的体能都得到了改善，提高了他们的机动性和生命值。"
+QuoteText="\"喜欢的士兵出现的太晚了? 在大佬的队伍里带上他吧！可不是只有杀敌才能获得经验。。 \""
+QuoteTextAuthor="- 中央官员布拉德福德"
+PreMissionText="梦魇狼术酱。"
+PostMissionSuccessText="反击暗事件：高级调理"
+PostMissionFailureText="对抗黑暗事件失败：高级调理"

[DarkEventAbility_AdventAdvancedCombatTraining X2AbilityTemplate]
LocFriendlyName="黑暗事件：高级战斗训练"
LocFlyoverText="黑暗事件：高级战斗训练"
LocLongDescription="所有变种人士兵获得 <Ability:ADVENT_ADVANCED_COMBAT_TRAINING_AIM/>% 瞄准增加、<Ability:ADVENT_ADVANCED_COMBAT_TRAINING_CRIT/> 暴击几率和 <Ability:ADVENT_ADVANCED_COMBAT_TRAINING_DEFENSE/> 防御力。"
LocHelpText="奖励瞄准和防御。"
LocPromotionPopupText="变种人单位获得<Ability:ADVENT_ADVANCED_COMBAT_TRAINING_AIM/>%瞄准、<Ability:ADVENT_ADVANCED_COMBAT_TRAINING_CRIT/>暴击率和<Ability:ADVENT_ADVANCED_COMBAT_TRAINING_DEFENSE/>防御。"

[DarkEvent_AdventAdvancedCombatTraining X2DarkEventTemplate]
+DisplayName="变种人高级战斗训练"
+SummaryText="所有变种人士兵都接受了改进的战斗训练，提高了他们的瞄准暴击几率和防御力。"
+QuoteText="\"嗯？伤害太低?试试破甲吧！\""
+QuoteTextAuthor="- 梦魇狼术酱"
+PreMissionText="所有变种人士兵的瞄准、暴击几率和防御力均有所提高。"
+PostMissionSuccessText="反击黑暗事件：高级战斗训练"
+PostMissionFailureText="对抗黑暗事件：高级战斗训练失败"


;机器人黑暗事件
[DarkEventAbility_AdvancedMechatronics X2AbilityTemplate]
LocFriendlyName="黑暗事件：高级机电一体化"
LocFlyoverText="黑暗事件：高级机电一体化"
LocLongDescription="所有变种人机器人单位生命值增加 <Ability:ROBOT_ADVANCED_MECHATRONICS_HP/>%，移动性增加 <Ability:ROBOT_ADVANCED_MECHATRONICS_MOBILITY/>%，装甲增加 <Ability:ROBOT_ADVANCED_MECHATRONICS_ARMOR/>。"
LocHelpText="额外的机动性和生命值。"
LocPromotionPopupText="变种人机器人单位生命值增加 <Ability:ROBOT_ADVANCED_MECHATRONICS_HP/>%，移动性增加 <Ability:ROBOT_ADVANCED_MECHATRONICS_MOBILITY/>%，装甲增加 <Ability:ROBOT_ADVANCED_MECHATRONICS_ARMOR/>。"

[DarkEvent_AdvancedMechatronics X2DarkEventTemplate]
+DisplayName="高级机电一体化"
+SummaryText="所有变种人机器人单元都受益于改进的机电一体化，提高了它们的机动性和健康状况。"
+QuoteText="\"安魂曲神坛一炮威力太强了? 那就带致残别让他行动 \""
+QuoteTextAuthor="-梦魇狼术酱"
+PreMissionText="所有机器人单位都增加了机动性和生命值。"
+PostMissionSuccessText="反击黑暗事件：高级机电一体化"
+PostMissionFailureText="对抗黑暗事件失败：高级机电一体化"

[DarkEventAbility_AdvancedCombatAI X2AbilityTemplate]
LocFriendlyName="黑暗事件：高级战斗AI"
LocFlyoverText="黑暗事件：高级战斗人工智能"
LocLongDescription="所有变种人机器人单位获得 <Ability:ROBOT_ADVANCED_COMBAT_AI_AIM/>% 瞄准增加、<Ability:ROBOT_ADVANCED_COMBAT_AI_CRIT/> 暴击几率和 <Ability:ROBOT_ADVANCED_COMBAT_AI_DEFENSE/> 防御。"
LocHelpText="奖励瞄准和防御。"
LocPromotionPopupText="变种人机器人单位获得 <Ability:ROBOT_ADVANCED_COMBAT_AI_AIM/>% 瞄准、<Ability:ROBOT_ADVANCED_COMBAT_AI_CRIT/> 暴击率和 <Ability:ROBOT_ADVANCED_COMBAT_AI_DEFENSE/> 防御。"

[DarkEvent_AdvancedCombatAI X2DarkEventTemplate]
+DisplayName="高级战斗人工智能"
+SummaryText="所有变种人机器人单位都获得了改进的战斗人工智能，提高了他们的目标、暴击机会和防御力。"
+QuoteText="\"魔法少女提示您，玩手枪也可以玩魔导弓。 \""
+QuoteTextAuthor="-梦魇狼术酱"
+PreMissionText="所有变种人机器人单位的瞄准、暴击几率和防御力均有所提高。"
+PostMissionSuccessText="反击黑暗事件：高级战斗人工智能"
+PostMissionFailureText="对抗黑暗事件失败：高级战斗AI"

;毒蛇黑暗事件
[DarkEventAbility_AdvancedViperGenetics X2AbilityTemplate]
LocFriendlyName="黑暗事件：高级毒蛇遗传学"
LocFlyoverText="黑暗事件：高级毒蛇遗传学"
LocLongDescription="所有毒蛇生命值增加 <Ability:ADVANCED_VIPER_GENETICS_HP/>%，移动性增加 <Ability:ADVANCED_VIPER_GENETICS_MOBILITY/>%。"
LocHelpText="额外的机动性和生命值。"
LocPromotionPopupText="毒蛇生命值增加 <Ability:ADVANCED_VIPER_GENETICS_HP/>%，移动性增加 <Ability:ADVANCED_VIPER_GENETICS_MOBILITY/>%。"

[DarkEvent_AdvancedViperGenetics X2DarkEventTemplate]
+DisplayName="高级毒蛇遗传学"
+SummaryText="所有毒蛇的机动性和生命值都有所提高。"
+QuoteText="\"别对寒霜军团寒霜类攻击，这对他们来说还是太舒服了\""
+QuoteTextAuthor="-梦魇狼术酱"
+PreMissionText="所有毒蛇都增加了机动性和生命值。"
+PostMissionSuccessText="反击黑暗事件：高级毒蛇遗传学"
+PostMissionFailureText="对抗黑暗事件失败：高级毒蛇遗传学"

[DarkEventAbility_AdvancedViperCombatTraining X2AbilityTemplate]
LocFriendlyName="黑暗事件：高级毒蛇战斗训练"
LocFlyoverText="黑暗事件：高级毒蛇战斗训练"
LocLongDescription="所有毒蛇获得 <Ability:ADVANCED_VIPER_COMBAT_TRAINING_AIM/>% 瞄准增加、<Ability:ADVANCED_VIPER_COMBAT_TRAINING_CRIT/> 暴击几率和 <Ability:ADVANCED_VIPER_COMBAT_TRAINING_DEFENSE/> 防御。"
LocHelpText="奖励瞄准和防御。"
LocPromotionPopupText="毒蛇获得 <Ability:ADVANCED_VIPER_COMBAT_TRAINING_AIM/>% 瞄准、<Ability:ADVANCED_VIPER_COMBAT_TRAINING_CRIT/> 暴击率和 <Ability:ADVANCED_VIPER_COMBAT_TRAINING_DEFENSE/> 防御。"

[DarkEvent_AdvancedViperCombatTraining X2DarkEventTemplate]
+DisplayName="高级毒蛇战斗训练"
+SummaryText="所有毒蛇都接受了改进的战斗训练，提高了他们的目标、暴击机会和防御力。"
+QuoteText="\"士兵间的羁绊可不在只是说说而已，羁绊越高的队友之间配合起来更得心应手\""
+QuoteTextAuthor="-梦魇狼术酱"
+PreMissionText="所有毒蛇的瞄准、暴击几率和防御力均有所提高。"
+PostMissionSuccessText="反击黑暗事件：高级毒蛇战斗训练"
+PostMissionFailureText="对抗黑暗事件失败：高级毒蛇战斗训练"

;Sectoid黑暗事件
[DarkEventAbility_AdvancedSectoidGenetics X2AbilityTemplate]
LocFriendlyName="黑暗事件：高级宗派遗传学"
LocFlyoverText="黑暗事件：高级宗派遗传学"
LocLongDescription="所有灰人都获得 <Ability:ADVANCED_SECTOID_GENETICS_HP/>% 生命值提升和 <Ability:ADVANCED_SECTOID_GENETICS_MOBILITY/>% 移动能力。"
LocHelpText="额外的机动性和生命值。"
LocPromotionPopupText="灰人获得 <Ability:ADVANCED_SECTOID_GENETICS_HP/>% 生命值提升和 <Ability:ADVANCED_SECTOID_GENETICS_MOBILITY/>% 移动能力。"

[DarkEvent_AdvancedSectoidGenetics X2DarkEventTemplate]
+DisplayName="高级灰人遗传学"
+SummaryText="所有灰人的机动性和生命值都有所提高。"
+QuoteText="\"魔法少女的数量超出你的承受极限?你只能选择回到更久远的过去来逃避了，除非你有能力杀出重围\""
+QuoteTextAuthor="-梦魇狼术酱"
+PreMissionText="所有灰人都增加了机动性和生命值。"
+PostMissionSuccessText="反击黑暗事件：高级灰人遗传学"
+PostMissionFailureText="对抗黑暗事件失败：高级灰人遗传学"

[DarkEventAbility_AdvancedSectoidCombatTraining X2AbilityTemplate]
LocFriendlyName="黑暗事件：高级灰人战斗训练"
LocFlyoverText="黑暗事件：高级灰人战斗训练"
LocLongDescription="所有灰人获得 <Ability:ADVANCED_SECTOID_COMBAT_TRAINING_AIM/>% 瞄准增加、<Ability:ADVANCED_SECTOID_COMBAT_TRAINING_CRIT/> 暴击几率和 <Ability:ADVANCED_SECTOID_COMBAT_TRAINING_DEFENSE/> 防御。"
LocHelpText="奖励瞄准和防御。"
LocPromotionPopupText="灰人获得 <Ability:ADVANCED_SECTOID_COMBAT_TRAINING_AIM/>% 瞄准力、<Ability:ADVANCED_SECTOID_COMBAT_TRAINING_CRIT/> 暴击率和 <Ability:ADVANCED_SECTOID_COMBAT_TRAINING_DEFENSE/> 防御力。"

[DarkEvent_AdvancedSectoidCombatTraining X2DarkEventTemplate]
+DisplayName="高级灰人战斗训练"
+SummaryText="所有灰人都接受了改进的战斗训练，提高了他们的目标、暴击几率和防御力。"
+QuoteText="\"在获取情报的任务里不要光顾着杀怪而把任务目标给遗忘了，有时候战斗的余波也许会摧毁目标任务！\""
+QuoteTextAuthor="-梦魇狼术酱"
+PreMissionText="所有灰人的瞄准、暴击几率和防御力均有所提高。"
+PostMissionSuccessText="反击黑暗事件：高级宗派战斗训练"
+PostMissionFailureText="对抗黑暗事件失败：高级宗派战斗训练"

;Muton和Berserker黑暗事件
[DarkEventAbility_AdvancedMutonGenetics X2AbilityTemplate]
LocFriendlyName="黑暗事件：高级异变者遗传学"
LocFlyoverText="黑暗事件：高级异变者遗传学"
LocLongDescription="所有异变者和狂战士的生命值增加 <Ability:ADVANCED_MUTON_GENETICS_HP/>%，移动力增加 <Ability:ADVANCED_MUTON_GENETICS_MOBILITY/>%。"
LocHelpText="额外的机动性和生命值。"
LocPromotionPopupText="异变者和狂战士的生命值增加 <Ability:ADVANCED_MUTON_GENETICS_HP/>%，移动力增加 <Ability:ADVANCED_MUTON_GENETICS_MOBILITY/>%。"

[DarkEvent_AdvancedMutonGenetics X2DarkEventTemplate]
+DisplayName="高级异变者遗传学"
+SummaryText="所有异变者和狂战士的机动性和生命值都有所提高。"
+QuoteText="\"我们魔法少女可以为你们生寄生兽小可爱，但是不要告诉别人哦\""
+QuoteTextAuthor="-梦魇狼术酱"
+PreMissionText="所有异变者和狂战士的机动性和生命值都有所提高。"
+PostMissionSuccessText="反击黑暗事件：高级异变者遗传学"
+PostMissionFailureText="对抗黑暗事件失败：高级异变者遗传学"

[DarkEventAbility_AdvancedMutonCombatTraining X2AbilityTemplate]
LocFriendlyName="黑暗事件：高级异变者战斗训练"
LocFlyoverText="黑暗事件：高级异变者战斗训练"
LocLongDescription="所有异变者和狂战士获得 <Ability:ADVANCED_MUTON_COMBAT_TRAINING_AIM/>% 瞄准增加、<Ability:ADVANCED_MUTON_COMBAT_TRAINING_CRIT/> 暴击率和 <Ability:ADVANCED_MUTON_COMBAT_TRAINING_DEFENSE/> 防御。"
LocHelpText="奖励瞄准和防御。"
LocPromotionPopupText="异变者和狂战士获得 <Ability:ADVANCED_MUTON_COMBAT_TRAINING_AIM/>% 瞄准、<Ability:ADVANCED_MUTON_COMBAT_TRAINING_CRIT/> 暴击率和 <Ability:ADVANCED_MUTON_COMBAT_TRAINING_DEFENSE/> 防御。"

[DarkEvent_AdvancedMutonCombatTraining X2DarkEventTemplate]
+DisplayName="高级异变者战斗训练"
+SummaryText="所有异变者和狂战士都接受了改进的战斗训练，提高了他们的目标、暴击机会和防御力。"
+QuoteText="\"下水道做战时，注意可见度！\""
+QuoteTextAuthor="-雨宫千音"
+PreMissionText="所有异变者和狂战士的瞄准、暴击几率和防御力均有所提高。"
+PostMissionSuccessText="反击黑暗事件：高级异变者战斗训练"
+PostMissionFailureText="对抗黑暗事件失败：高级异变者战斗训练"

;寄生兽黑暗事件
[DarkEventAbility_AdvancedChryssalidGenetics X2AbilityTemplate]
LocFriendlyName="黑暗事件：高级寄生兽遗传学"
LocFlyoverText="黑暗事件：高级寄生兽遗传学"
LocLongDescription="所有寄生兽生命值增加 <Ability:ADVANCED_CHRYSSALID_GENETICS_HP/>%，移动性增加 <Ability:ADVANCED_CHRYSSALID_GENETICS_MOBILITY/>%。"
LocHelpText="额外的机动性和生命值。"
LocPromotionPopupText="寄生兽生命值增加 <Ability:ADVANCED_CHRYSSALID_GENETICS_HP/>%，移动性增加 <Ability:ADVANCED_CHRYSSALID_GENETICS_MOBILITY/>%。"

[DarkEvent_AdvancedChryssalidGenetics X2DarkEventTemplate]
+DisplayName="高级寄生兽遗传学"
+SummaryText="所有寄生兽都增加了机动性和生命值。"
+QuoteText="\"不躲进掩体无异于送死，半掩体不配算掩体 \""
+QuoteTextAuthor="-雨宫千音"
+PreMissionText="所有寄生兽都增加了机动性和生命值。"
+PostMissionSuccessText="反击黑暗事件：高级寄生兽遗传学"
+PostMissionFailureText="对抗黑暗事件失败：高级寄生兽遗传学"

[DarkEventAbility_AdvancedChryssalidCombatTraining X2AbilityTemplate]
LocFriendlyName="黑暗事件：高级寄生兽战斗训练"
LocFlyoverText="黑暗事件：高级寄生兽战斗训练"
LocLongDescription="所有寄生兽获得 <Ability:ADVANCED_CHRYSSALID_COMBAT_TRAINING_AIM/>% 瞄准增加、<Ability:ADVANCED_CHRYSSALID_COMBAT_TRAINING_CRIT/> 暴击几率和 <Ability:ADVANCED_CHRYSSALID_COMBAT_TRAINING_DEFENSE/> 防御。"
LocHelpText="奖励瞄准和防御。"
LocPromotionPopupText="寄生兽获得 <Ability:ADVANCED_CHRYSSALID_COMBAT_TRAINING_AIM/>% 瞄准力、<Ability:ADVANCED_CHRYSSALID_COMBAT_TRAINING_CRIT/> 暴击率和 <Ability:ADVANCED_CHRYSSALID_COMBAT_TRAINING_DEFENSE/> 防御力。"

[DarkEvent_AdvancedChryssalidCombatTraining X2DarkEventTemplate]
+DisplayName="高级寄生兽战斗训练"
+SummaryText="所有寄生兽都接受了改进的战斗训练，提高了它们的目标、暴击几率和防御力。"
+QuoteText="\"只会近战?没事，堵住楼梯口就好了，现在是打靶时刻\""
+QuoteTextAuthor="-雨宫千音"
+PreMissionText="所有寄生兽都提高了瞄准力、暴击几率和防御力。"
+PostMissionSuccessText="反击黑暗事件：高级寄生兽战斗训练"
+PostMissionFailureText="对抗黑暗事件失败：高级寄生兽战斗训练"